const body = document.body;
body.style.background = "#27496D";

// task 1

const playerSectionTitle = document.getElementById("player-section-title");
playerSectionTitle.style.color = "#226597";

const blogSectionTitle = document.getElementById("blog-section-title");
blogSectionTitle.style.color = "#226597";

const courseSectionTitle = document.getElementById("course-section-title");
courseSectionTitle.style.color = "#226597";

// task 2

const players = document.querySelector("#player");
players.style.background = "#27496D";
players.style.color = "#fff";

/*

৩. ওয়েবসাইট এর নিচে একটা ul list যোগ করো। সেখানে তোমার ইচ্ছামতো তিনটা আইটেম যোগ করো। তারপর ul এর নিচে একটা বাটন যোগ করো। এখন তোমার কাজ হবে। বাটনে যতবার ক্লিক করবে। ul এর মধ্যে নতুন একটা লিস্ট আইটেম যোগ হবে। 



৪. এখন ul এর নিচে একটা ইনপুট ফিল্ড আর একটা বাটন যোগ করো। ইনপুট ফিল্ড এ শুরুতে মান হবে শূন্য (০)। তারপর ইনপুট ফিল্ডের পাশের নতুন বাটন এ যতবার প্রেস করবে ততবার এক এক করে ইনপুট ফিল্ড এর মান এক এক করে বাড়বে। 



৫. (চ্যালেঞ্জিং ওয়ান)উপরে বাটনে দুইটা শর্ত আছে। সেটা হচ্ছে সংখ্যা বাড়লেও সেটা হবে সর্বোচ্চ ৫। অর্থাৎ ০ থেকে এক এক করে বেড়ে বেড়ে পাঁচ পর্যন্ত হতে পারে। তার উপরে আর বাড়বে না। এবং ৫ হয়ে গেলে বাটনটা ডিজেবল হয়ে যাবে। 

.

প্রজেক্ট চ্যালেঞ্জ 

৬. শপিং কার্ট এর ডিজাইন দেখো। তারপর নিজে নিজে HTML, CSS (মন চাইলে কোন ফ্রেমওয়ার্ক বুটস্ট্র্যাপ বা টেইলউইন্ড) দিয়ে অথবা css৩ দিয়ে নিজে নিজে সিম্পল সাইট বানিয়ে ফল। 



৭. তারপর শপিং কার্ট প্রজেক্টটা ইন্টারএকটিভ করার কাজটা নিজে নিজে করো। একটা শর্ত রাখতে পারো যে-- আমাদের ভিডিও না দেখে করতে পারো কিনা। যদি আমাদের ভিডিও না দেখে করতে পারো। তাহলে সেটা খুবই চমৎকার হবে। আমাদের ভিডিও না দেখলেও গুগল বা ইউটিউবে সার্চ দিতে পারবে। আর যদি একান্তই করতে না পারো। তাহলে টুক করে আমাদের ভিডিও দেখে ফেলো। 



.



স্ট্রিং এবং array 

৮. একটা array এর মধ্যে অনেকগুলা ইংরেজি জাভাস্ক্রিপ্ট রিলেটেড বইয়ের নাম (স্ট্রিং) আছে। জাভাস্ক্রিপ্ট রিলেটেড বইয়ের নাম না জানলে, গুগলে সার্চ দিয়ে বের করো। তারপর একটা লুপ চালিয়ে দেখো কোন কোন বইয়ের নামের মধ্যে "javascript" আছে। তাহলে সেই বইগুলার নাম আরেকটা array এর মধ্যে রাখবে। আর হ্যাঁ, যখন javascript আছে কিনা চেক করবে তখন খেয়াল করবে বড়হাতের নাকি ছোট হাতের অক্ষর সেটা বাদ দিয়ে চেক করতে। অর্থাৎ কেইস ইনসেন্সিটিভ হবে। 



৯. অনেকগুলা সংখ্যাওয়ালা একটা array নাও। তারপর সেই array কে sort করো। sort হবে ছোট থেকে বড় সংখ্যার সিরিয়াল অনুসারে। 

 */
